pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_mpc.h
/*
 * Copyright (c) 2023 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_MPC_H_
#define NRF_MPC_H_

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_mpc_hal MPC HAL
 * @{
 * @ingroup nrf_mpc
 * @brief   Hardware access layer for managing the Memory Privilege Controller (MPC)
 *          peripheral.
 */

#if defined(MPC_RTCHOKE_WRITEACCESS_ENABLE0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether RTCHOKE functionality is present. */
#define NRF_MPC_HAS_RTCHOKE 1
#else
#define NRF_MPC_HAS_RTCHOKE 0
#endif

#if defined(MPC_OVERRIDE_CONFIG_SECDOMENABLE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SECDOM functionality is present. */
#define NRF_MPC_HAS_SECDOM 1
#else
#define NRF_MPC_HAS_SECDOM 0
#endif

#if defined(MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether configuration of global slave master port connection is present. */
#define NRF_MPC_HAS_GLOBALSLAVE 1
#else
#define NRF_MPC_HAS_GLOBALSLAVE 0
#endif

#if defined(MPC_OVERRIDE_OFFSET_OFFSET_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether configuration of offset for override region is present. */
#define NRF_MPC_HAS_OVERRIDE_OFFSET 1
#else
#define NRF_MPC_HAS_OVERRIDE_OFFSET 0
#endif

#if defined(MPC_OVERRIDE_OWNER_OWNERID_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether configuration of owner for override region is present. */
#define NRF_MPC_HAS_OVERRIDE_OWNERID 1
#else
#define NRF_MPC_HAS_OVERRIDE_OWNERID 0
#endif

#if defined(MPC_OVERRIDE_MASTERPORT_ENABLE0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether configuration of master port for override region is present. */
#define NRF_MPC_HAS_OVERRIDE_MASTERPORT 1
#else
#define NRF_MPC_HAS_OVERRIDE_MASTERPORT 0
#endif

#if defined(MPC_OVERRIDE_CONFIG_SLAVENUMBER_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether configuration of slave for override region is present. */
#define NRF_MPC_HAS_OVERRIDE_SLAVENUMBER 1
#else
#define NRF_MPC_HAS_OVERRIDE_SLAVENUMBER 0
#endif

#if defined(MPC_OVERRIDE_CONFIG_SECUREMASK_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether secure bit check for override region indication is present. */
#define NRF_MPC_HAS_OVERRIDE_SECUREMASK 1
#else
#define NRF_MPC_HAS_OVERRIDE_SECUREMASK 0
#endif

#if defined(MPC_REGION_MaxCount) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether region configuration is present. */
#define NRF_MPC_HAS_REGION 1
#else
#define NRF_MPC_HAS_REGION 0
#endif

#if NRF_MPC_HAS_REGION
/** @brief Number of regions. */
#define NRF_MPC_REGION_COUNT   MPC_REGION_MaxCount
#endif

/** @brief Number of override regions. */
#define NRF_MPC_OVERRIDE_COUNT MPC_OVERRIDE_MaxCount

#if NRF_MPC_HAS_REGION
/** @brief Number of master ports. */
#define NRF_MPC_MASTER_PORTS_COUNT MPC_MASTER_PORTS_MaxCount
#endif

#if NRF_MPC_HAS_RTCHOKE
/** @brief Number of Real Time Choke slaves. */
#define NRF_MPC_RTCHOKE_COUNT  MPC_RTCHOKE_DELAY_MaxCount
#endif

/** @brief MPC events. */
typedef enum
{
    NRF_MPC_EVENT_MEMACCERR = offsetof(NRF_MPC_Type, EVENTS_MEMACCERR),
} nrf_mpc_event_t;

/** @brief MPC interrupts. */
typedef enum
{
    NRF_MPC_INT_MEMACCERR_MASK = MPC_INTENSET_MEMACCERR_Msk,
} nrf_mpc_int_mask_t;

/** @brief Error sources. */
typedef enum
{
    NRF_MPC_ERRORSOURCE_SLAVE = MPC_MEMACCERR_INFO_ERRORSOURCE_Slave,
    NRF_MPC_ERRORSOURCE_MPC   = MPC_MEMACCERR_INFO_ERRORSOURCE_MPC,
} nrf_mpc_errorsource_t;

/**
 * @brief Permissions mask.
 *
 * @note This enum may be used for both permission settings and permission settings mask.
 */
typedef enum
{
    NRF_MPC_PERM_READ_MASK    = MPC_OVERRIDE_PERM_READ_Msk,
    NRF_MPC_PERM_WRITE_MASK   = MPC_OVERRIDE_PERM_WRITE_Msk,
    NRF_MPC_PERM_EXECUTE_MASK = MPC_OVERRIDE_PERM_EXECUTE_Msk,
    NRF_MPC_PERM_SECURE_MASK  = MPC_OVERRIDE_PERM_SECATTR_Msk,
} nrf_mpc_permission_mask_t;

#if NRF_MPC_HAS_REGION
/** @brief Masterport mask. */
typedef enum
{
    NRF_MPC_MASTERPORT_0_MASK  = MPC_REGION_MASTERPORT_ENABLE0_Msk,
    NRF_MPC_MASTERPORT_1_MASK  = MPC_REGION_MASTERPORT_ENABLE1_Msk,
    NRF_MPC_MASTERPORT_2_MASK  = MPC_REGION_MASTERPORT_ENABLE2_Msk,
    NRF_MPC_MASTERPORT_3_MASK  = MPC_REGION_MASTERPORT_ENABLE3_Msk,
    NRF_MPC_MASTERPORT_4_MASK  = MPC_REGION_MASTERPORT_ENABLE4_Msk,
    NRF_MPC_MASTERPORT_5_MASK  = MPC_REGION_MASTERPORT_ENABLE5_Msk,
    NRF_MPC_MASTERPORT_6_MASK  = MPC_REGION_MASTERPORT_ENABLE6_Msk,
    NRF_MPC_MASTERPORT_7_MASK  = MPC_REGION_MASTERPORT_ENABLE7_Msk,
    NRF_MPC_MASTERPORT_8_MASK  = MPC_REGION_MASTERPORT_ENABLE8_Msk,
    NRF_MPC_MASTERPORT_9_MASK  = MPC_REGION_MASTERPORT_ENABLE9_Msk,
    NRF_MPC_MASTERPORT_10_MASK = MPC_REGION_MASTERPORT_ENABLE10_Msk,
    NRF_MPC_MASTERPORT_11_MASK = MPC_REGION_MASTERPORT_ENABLE11_Msk,
#if (NRF_MPC_MASTER_PORTS_COUNT > 12)
    NRF_MPC_MASTERPORT_12_MASK = MPC_REGION_MASTERPORT_ENABLE12_Msk,
    NRF_MPC_MASTERPORT_13_MASK = MPC_REGION_MASTERPORT_ENABLE13_Msk,
    NRF_MPC_MASTERPORT_14_MASK = MPC_REGION_MASTERPORT_ENABLE14_Msk,
#endif
#if (NRF_MPC_MASTER_PORTS_COUNT > 15)
    NRF_MPC_MASTERPORT_15_MASK = MPC_REGION_MASTERPORT_ENABLE15_Msk,
    NRF_MPC_MASTERPORT_16_MASK = MPC_REGION_MASTERPORT_ENABLE16_Msk,
    NRF_MPC_MASTERPORT_17_MASK = MPC_REGION_MASTERPORT_ENABLE17_Msk,
    NRF_MPC_MASTERPORT_18_MASK = MPC_REGION_MASTERPORT_ENABLE18_Msk,
    NRF_MPC_MASTERPORT_19_MASK = MPC_REGION_MASTERPORT_ENABLE19_Msk,
    NRF_MPC_MASTERPORT_20_MASK = MPC_REGION_MASTERPORT_ENABLE20_Msk,
    NRF_MPC_MASTERPORT_21_MASK = MPC_REGION_MASTERPORT_ENABLE21_Msk,
    NRF_MPC_MASTERPORT_22_MASK = MPC_REGION_MASTERPORT_ENABLE22_Msk,
    NRF_MPC_MASTERPORT_23_MASK = MPC_REGION_MASTERPORT_ENABLE23_Msk,
    NRF_MPC_MASTERPORT_24_MASK = MPC_REGION_MASTERPORT_ENABLE24_Msk,
    NRF_MPC_MASTERPORT_25_MASK = MPC_REGION_MASTERPORT_ENABLE25_Msk,
    NRF_MPC_MASTERPORT_26_MASK = MPC_REGION_MASTERPORT_ENABLE26_Msk,
    NRF_MPC_MASTERPORT_27_MASK = MPC_REGION_MASTERPORT_ENABLE27_Msk,
    NRF_MPC_MASTERPORT_28_MASK = MPC_REGION_MASTERPORT_ENABLE28_Msk,
    NRF_MPC_MASTERPORT_29_MASK = MPC_REGION_MASTERPORT_ENABLE29_Msk,
    NRF_MPC_MASTERPORT_30_MASK = MPC_REGION_MASTERPORT_ENABLE30_Msk,
    NRF_MPC_MASTERPORT_31_MASK = MPC_REGION_MASTERPORT_ENABLE31_Msk,
#endif
} nrf_mpc_masterport_mask_t;

/** @brief Region configuration. */
typedef struct
{
    uint8_t     slave_number;
    bool        lock;
    bool        enable;
    nrf_owner_t owner;
    uint32_t    permissions;
} nrf_mpc_region_config_t;
