pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_mpc.h
#endif // NRF_MPC_HAS_REGION

/** @brief Override region configuration. */
typedef struct
{
    uint8_t slave_number;
    bool    lock;
    bool    enable;
    bool    secdom_enable;
    bool    secure_mask;   /**< Secure mask. Read only.
                            *   If set, the bit 28 of the transaction is ignored while address matching. */
} nrf_mpc_override_config_t;

/**
 * @brief Function for retrieving the state of the specified MPC event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be checked.
 *
 * @retval true  The event has been generated.
 * @retval false The event has not been generated.
 */
NRF_STATIC_INLINE bool nrf_mpc_event_check(NRF_MPC_Type const * p_reg, nrf_mpc_event_t event);

/**
 * @brief Function for clearing the specified MPC event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be cleared.
 */
NRF_STATIC_INLINE void nrf_mpc_event_clear(NRF_MPC_Type * p_reg, nrf_mpc_event_t event);

/**
 * @brief Function for getting the address of the specified MPC event register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to get the address of.
 *
 * @return Address of the specified event register.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_event_address_get(NRF_MPC_Type const * p_reg,
                                                     nrf_mpc_event_t      event);

/**
 * @brief Function for enabling the specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be enabled.
 *                  Use @ref nrf_mpc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_mpc_int_enable(NRF_MPC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for checking if the specified interrupts are enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be checked.
 *                  Use @ref nrf_mpc_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_int_enable_check(NRF_MPC_Type const * p_reg, uint32_t mask);

/**
 * @brief Function for disabling the specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be disabled.
 *                  Use @ref nrf_mpc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_mpc_int_disable(NRF_MPC_Type * p_reg, uint32_t mask);

#if NRF_MPC_HAS_REGION
/**
 * @brief Function for setting configuration of the region.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] index    Region index.
 * @param[in] p_config Pointer to the structure of the region configuration parameters.
 */
NRF_STATIC_INLINE void nrf_mpc_region_config_set(NRF_MPC_Type *                  p_reg,
                                                 uint8_t                         index,
                                                 nrf_mpc_region_config_t const * p_config);

/**
 * @brief Function for getting configuration of the region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Region index.
 *
 * @return Structure with configuration of the region.
 */
NRF_STATIC_INLINE nrf_mpc_region_config_t nrf_mpc_region_config_get(NRF_MPC_Type const * p_reg,
                                                                    uint8_t              index);

/**
 * @brief Function for setting start address of the region.
 *
 * @note Address must be on a 4kB memory boundary.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] index   Region index.
 * @param[in] address Address to be set.
 */
NRF_STATIC_INLINE void nrf_mpc_region_startaddr_set(NRF_MPC_Type * p_reg,
                                                    uint8_t        index,
                                                    uint32_t       address);

/**
 * @brief Function for getting start address of the region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Region index.
 *
 * @return Start address of the region.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_region_startaddr_get(NRF_MPC_Type const * p_reg, uint8_t index);

/**
 * @brief Function for setting address mask of the region.
 *
 * @note Mask must be on a 4kB memory boundary.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] index   Region index.
 * @param[in] address Address to be set.
 */
NRF_STATIC_INLINE void nrf_mpc_region_addrmask_set(NRF_MPC_Type * p_reg,
                                                   uint8_t        index,
                                                   uint32_t       address);

/**
 * @brief Function for getting address mask of the region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Region index.
 *
 * @return Address mask of the region.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_region_addrmask_get(NRF_MPC_Type const * p_reg, uint8_t index);

/**
 * @brief Function for enabling the specified master ports of the region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Region index.
 * @param[in] mask  Mask of master ports to be enabled,
 *                  constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_region_masterport_set(NRF_MPC_Type * p_reg,
                                                     uint8_t        index,
                                                     uint32_t       mask);

/**
 * @brief Function for getting enabled master ports of the region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Region index.
 *
 * @return Mask of enabled master ports,
 *         constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_region_masterport_get(NRF_MPC_Type const * p_reg, uint8_t index);
#endif // NRF_MPC_HAS_REGION

/**
 * @brief Function for setting configuration of the override region.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] index    Override region index.
 * @param[in] p_config Pointer to the structure of the override region configuration parameters.
 */
NRF_STATIC_INLINE void nrf_mpc_override_config_set(NRF_MPC_Type *                    p_reg,
                                                   uint8_t                           index,
                                                   nrf_mpc_override_config_t const * p_config);

/**
 * @brief Function for getting configuration of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Structure with configuration of the override region.
 */
NRF_STATIC_INLINE nrf_mpc_override_config_t nrf_mpc_override_config_get(NRF_MPC_Type const * p_reg,
                                                                        uint8_t              index);

/**
 * @brief Function for setting start address of the override region.
 *
 * @note Address must be on a 4kB memory boundary.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] index   Override region index.
 * @param[in] address Address to be set.
 */
NRF_STATIC_INLINE void nrf_mpc_override_startaddr_set(NRF_MPC_Type * p_reg,
                                                      uint8_t        index,
                                                      uint32_t       address);

/**
 * @brief Function for getting start address of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Start address of the override region.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_override_startaddr_get(NRF_MPC_Type const * p_reg,
                                                          uint8_t              index);

/**
 * @brief Function for setting end address of the override region.
 *
 * @note Address must be on a 4kB memory boundary.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] index   Override region index.
 * @param[in] address Address to be set.
 */
NRF_STATIC_INLINE void nrf_mpc_override_endaddr_set(NRF_MPC_Type * p_reg,
                                                    uint8_t        index,
                                                    uint32_t       address);

/**
 * @brief Function for getting end address of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return End address of the override region.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_override_endaddr_get(NRF_MPC_Type const * p_reg,
                                                        uint8_t              index);

#if NRF_MPC_HAS_OVERRIDE_OFFSET
/**
 * @brief Function for setting offset of the override region.
 *
 * @note Offset will be left shifted before applying, creating a 33-bit signed integer.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] index  Override region index.
 * @param[in] offset Address offset value divided by 2.
 */
NRF_STATIC_INLINE void nrf_mpc_override_offset_set(NRF_MPC_Type * p_reg,
                                                   uint8_t        index,
                                                   uint32_t       offset);

/**
 * @brief Function for getting offset of the override region.
 *
 * @note Offset is left shifted before applying, creating a 33-bit signed integer.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Address offset value divided by 2.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_override_offset_get(NRF_MPC_Type const * p_reg,
                                                       uint8_t              index);
#endif

/**
 * @brief Function for setting permission settings for the override region.
 *
 * @param[in] p_reg       Pointer to the structure of registers of the peripheral.
 * @param[in] index       Override region index.
 * @param[in] permissions Mask of permissions to be set,
 *                        constructed from @ref nrf_mpc_permission_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_override_perm_set(NRF_MPC_Type * p_reg,
                                                 uint8_t        index,
                                                 uint32_t       permissions);

/**
 * @brief Function for getting permission settings of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Mask of permissions, constructed from @ref nrf_mpc_permission_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_override_perm_get(NRF_MPC_Type const * p_reg,
                                                     uint8_t              index);

/**
 * @brief Function for setting permission settings mask for the override region.
 *
 * @param[in] p_reg       Pointer to the structure of registers of the peripheral.
 * @param[in] index       Override region index.
 * @param[in] permissions Mask of permissions settings mask to be set,
 *                        constructed from @ref nrf_mpc_permission_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_override_permmask_set(NRF_MPC_Type * p_reg,
                                                     uint8_t        index,
                                                     uint32_t       permissions);

/**
 * @brief Function for getting permission settings mask of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Mask of permissions settings mask,
 *         constructed from @ref nrf_mpc_permission_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_override_permmask_get(NRF_MPC_Type const * p_reg,
                                                         uint8_t              index);

#if NRF_MPC_HAS_OVERRIDE_OWNERID
/**
 * @brief Function for setting owner ID for the override region.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] index    Override region index.
 * @param[in] owner_id Owner ID to be set.
 */
NRF_STATIC_INLINE void nrf_mpc_override_ownerid_set(NRF_MPC_Type * p_reg,
                                                    uint8_t        index,
                                                    nrf_owner_t    owner_id);

/**
 * @brief Function for getting owner ID of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Owner ID of the overridde region.
 */
NRF_STATIC_INLINE nrf_owner_t nrf_mpc_override_ownerid_get(NRF_MPC_Type const * p_reg,
                                                           uint8_t              index);
#endif

#if NRF_MPC_HAS_OVERRIDE_MASTERPORT
/**
 * @brief Function for enabling the specified master ports of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 * @param[in] mask  Mask of master ports to be enabled,
 *                  constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_override_masterport_set(NRF_MPC_Type * p_reg,
                                                       uint8_t        index,
                                                       uint32_t       mask);

/**
 * @brief Function for getting enabled master ports of the override region.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Override region index.
 *
 * @return Mask of enabled master ports,
 *         constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_override_masterport_get(NRF_MPC_Type const * p_reg,
                                                           uint8_t              index);
#endif

/**
 * @brief Function for getting the memory address of memory access error.
 *
 * @note Register content will not be changed as long as MEMACCERR event is active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Target address for the errroneous access.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_memaccerr_address_get(NRF_MPC_Type const * p_reg);

#if NRF_MPC_HAS_OVERRIDE_OWNERID
/**
 * @brief Function for getting the owner identifier of the transaction that triggered memory access error.
 *
 * @note Register content will not be changed as long as MEMACCERR event is active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Owner identifier of the errorneous access.
 */
NRF_STATIC_INLINE nrf_owner_t nrf_mpc_memaccerr_info_ownerid_get(NRF_MPC_Type const * p_reg);
#endif

#if NRF_MPC_HAS_OVERRIDE_MASTERPORT
/**
 * @brief Function for getting the master port of the transaction that triggered memory access error.
 *
 * @note Register content will not be changed as long as MEMACCERR event is active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Master port where errorneous access is detected.
 */
NRF_STATIC_INLINE uint8_t nrf_mpc_memaccerr_info_masterport_get(NRF_MPC_Type const * p_reg);
#endif

/**
 * @brief Function for getting the permissions of the transaction that triggered memory access error.
 *
 * @note Register content will not be changed as long as MEMACCERR event is active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Permission settings of the errorneous access.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_memaccerr_info_perm_get(NRF_MPC_Type const * p_reg);

/**
 * @brief Function for getting the source of the transaction that triggered memory access error.
 *
 * @note Register content will not be changed as long as MEMACCERR event is active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Source of the errorneous access.
 */
NRF_STATIC_INLINE nrf_mpc_errorsource_t
nrf_mpc_memaccerr_info_errorsource_get(NRF_MPC_Type const * p_reg);

#if NRF_MPC_HAS_GLOBALSLAVE
/**
 * @brief Function for enabling the specified master ports connection to global slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of master ports to be connected,
 *                  constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_globalslave_masterport_set(NRF_MPC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for getting enabled master ports connection to global slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Mask of master ports connected,
 *         constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_globalslave_masterport_get(NRF_MPC_Type const * p_reg);

/**
 * @brief Function for enabling the global slave registers lock.
 *
 * @note When global slave registers is enabled, modifying the global slave configuration
 *       is not possible.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 */
NRF_STATIC_INLINE void nrf_mpc_globalslave_lock_enable(NRF_MPC_Type * p_reg);

/**
 * @brief Function for getting the status of the global slave registers lock.
 *
 * @note When global slave registers is enabled, modifying the global slave configuration
 *       is not possible.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return True if global slave registers are locked, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_mpc_globalslave_lock_check(NRF_MPC_Type const * p_reg);
#endif

#if NRF_MPC_HAS_RTCHOKE
/**
 * @brief Function for enabling the AXI Write Address Channel Real Time Choke for specified master ports.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of master ports to have the Write Real Time Choke enabled,
 *                  constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_rtchoke_writeaccess_set(NRF_MPC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for getting master ports with enabled AXI Write Address Channel Real Time Choke.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Mask of master ports with the Write Real Time Choke enabled,
 *         constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_rtchoke_writeaccess_get(NRF_MPC_Type const * p_reg);

/**
 * @brief Function for enabling the AXI Read Address Channel Real Time Choke for specified master ports.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of master ports to have the Read Real Time Choke enabled,
 *                  constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE void nrf_mpc_rtchoke_readaccess_set(NRF_MPC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for getting master ports with enabled AXI Read Address Channel Real Time Choke.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Mask of master ports with the Read Real Time Choke enabled,
 *         constructed from @ref nrf_mpc_masterport_mask_t enumerator values.
 */
NRF_STATIC_INLINE uint32_t nrf_mpc_rtchoke_readaccess_get(NRF_MPC_Type const * p_reg);

/**
 * @brief Function for setting the Real Time Choke delay for the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] slave Slave number.
 * @param[in] delay Delay value to be set.
 */
NRF_STATIC_INLINE void nrf_mpc_rtchoke_delay_set(NRF_MPC_Type * p_reg,
                                                 uint8_t        slave,
                                                 uint8_t        delay);

/**
 * @brief Function for getting the Real Time Choke delay for the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] slave Slave number.
 *
 * @return Delay value for slave.
 */
NRF_STATIC_INLINE uint8_t nrf_mpc_rtchoke_delay_get(NRF_MPC_Type const * p_reg, uint8_t slave);

#endif // NRF_MPC_HAS_RTCHOKE

#ifndef NRF_DECLARE_ONLY
NRF_STATIC_INLINE bool nrf_mpc_event_check(NRF_MPC_Type const * p_reg, nrf_mpc_event_t event)
{
    return nrf_event_check(p_reg, event);
}

