pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_mpc.h
NRF_STATIC_INLINE void nrf_mpc_event_clear(NRF_MPC_Type * p_reg, nrf_mpc_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0;
    nrf_event_readback((uint8_t *)p_reg + (uint32_t)event);
}

NRF_STATIC_INLINE uint32_t nrf_mpc_event_address_get(NRF_MPC_Type const * p_reg,
                                                     nrf_mpc_event_t      event)
{
    return nrf_task_event_address_get(p_reg, event);
}

NRF_STATIC_INLINE void nrf_mpc_int_enable(NRF_MPC_Type * p_reg, uint32_t mask)
{
    p_reg->INTENSET = mask;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_int_enable_check(NRF_MPC_Type const * p_reg, uint32_t mask)
{
    return p_reg->INTENSET & mask;
}

NRF_STATIC_INLINE void nrf_mpc_int_disable(NRF_MPC_Type * p_reg, uint32_t mask)
{
    p_reg->INTENCLR = mask;
}

#if NRF_MPC_HAS_REGION
NRF_STATIC_INLINE void nrf_mpc_region_config_set(NRF_MPC_Type *                  p_reg,
                                                 uint8_t                         index,
                                                 nrf_mpc_region_config_t const * p_config)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);
    NRFX_ASSERT(p_config != NULL);

    p_reg->REGION[index].CONFIG = (((p_config->slave_number <<
                                     MPC_REGION_CONFIG_SLAVENUMBER_Pos) &
                                    MPC_REGION_CONFIG_SLAVENUMBER_Msk) |
                                   ((p_config->lock ? MPC_REGION_CONFIG_LOCK_Locked :
                                     MPC_REGION_CONFIG_LOCK_Unlocked) <<
                                    MPC_REGION_CONFIG_LOCK_Pos) |
                                   ((p_config->enable ? MPC_REGION_CONFIG_ENABLE_Enabled :
                                     MPC_REGION_CONFIG_ENABLE_Disabled) <<
                                    MPC_REGION_CONFIG_ENABLE_Pos) |
                                   ((p_config->permissions << MPC_REGION_CONFIG_READ_Pos) &
                                    (MPC_REGION_CONFIG_READ_Msk | MPC_REGION_CONFIG_WRITE_Msk |
                                     MPC_REGION_CONFIG_EXECUTE_Msk |
                                     MPC_REGION_CONFIG_SECATTR_Msk)) |
                                   ((p_config->owner <<
                                     MPC_REGION_CONFIG_OWNERID_Pos) &
                                    MPC_REGION_CONFIG_OWNERID_Msk));
}

NRF_STATIC_INLINE nrf_mpc_region_config_t nrf_mpc_region_config_get(NRF_MPC_Type const * p_reg,
                                                                    uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);

    nrf_mpc_region_config_t ret;

    ret.slave_number = (p_reg->REGION[index].CONFIG & MPC_REGION_CONFIG_SLAVENUMBER_Msk)
                        >> MPC_REGION_CONFIG_SLAVENUMBER_Pos;

    ret.lock = ((p_reg->REGION[index].CONFIG & MPC_REGION_CONFIG_LOCK_Msk)
                >> MPC_REGION_CONFIG_LOCK_Pos) ==  MPC_REGION_CONFIG_LOCK_Locked;

    ret.enable = ((p_reg->REGION[index].CONFIG & MPC_REGION_CONFIG_ENABLE_Msk)
                  >> MPC_REGION_CONFIG_ENABLE_Pos) == MPC_REGION_CONFIG_ENABLE_Enabled;

    ret.permissions = (p_reg->REGION[index].CONFIG &
                       (MPC_REGION_CONFIG_READ_Msk | MPC_REGION_CONFIG_WRITE_Msk |
                        MPC_REGION_CONFIG_EXECUTE_Msk | MPC_REGION_CONFIG_SECATTR_Msk))
                      >> MPC_REGION_CONFIG_READ_Pos;

    ret.owner = (nrf_owner_t)((p_reg->REGION[index].CONFIG & MPC_REGION_CONFIG_OWNERID_Msk)
                              >> MPC_REGION_CONFIG_OWNERID_Pos);

    return ret;
}

NRF_STATIC_INLINE void nrf_mpc_region_startaddr_set(NRF_MPC_Type * p_reg,
                                                    uint8_t        index,
                                                    uint32_t       address)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);
    NRFX_ASSERT((address & 0xFFFUL) == 0);

    p_reg->REGION[index].STARTADDR = address;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_region_startaddr_get(NRF_MPC_Type const * p_reg, uint8_t index)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);

    return p_reg->REGION[index].STARTADDR;
}

NRF_STATIC_INLINE void nrf_mpc_region_addrmask_set(NRF_MPC_Type * p_reg,
                                                   uint8_t        index,
                                                   uint32_t       address)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);
    NRFX_ASSERT((address & 0xFFFUL) == 0);

    p_reg->REGION[index].ADDRMASK = address;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_region_addrmask_get(NRF_MPC_Type const * p_reg, uint8_t index)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);

    return p_reg->REGION[index].ADDRMASK;
}

NRF_STATIC_INLINE void nrf_mpc_region_masterport_set(NRF_MPC_Type * p_reg,
                                                     uint8_t        index,
                                                     uint32_t       mask)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);

    p_reg->REGION[index].MASTERPORT = mask;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_region_masterport_get(NRF_MPC_Type const * p_reg, uint8_t index)
{
    NRFX_ASSERT(index < NRF_MPC_REGION_COUNT);

    return p_reg->REGION[index].MASTERPORT;
}
#endif // NRF_MPC_HAS_REGION

NRF_STATIC_INLINE void nrf_mpc_override_config_set(NRF_MPC_Type *                    p_reg,
                                                   uint8_t                           index,
                                                   nrf_mpc_override_config_t const * p_config)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);
    NRFX_ASSERT(p_config != NULL);

    p_reg->OVERRIDE[index].CONFIG = (((p_config->lock ? MPC_OVERRIDE_CONFIG_LOCK_Locked :
                                       MPC_OVERRIDE_CONFIG_LOCK_Unlocked) <<
                                      MPC_OVERRIDE_CONFIG_LOCK_Pos) |
#if NRF_MPC_HAS_OVERRIDE_SLAVENUMBER
                                     ((p_config->slave_number <<
                                       MPC_OVERRIDE_CONFIG_SLAVENUMBER_Pos) &
                                      MPC_OVERRIDE_CONFIG_SLAVENUMBER_Msk) |
#endif
#if NRF_MPC_HAS_SECDOM
                                     ((p_config->secdom_enable ?
                                       MPC_OVERRIDE_CONFIG_SECDOMENABLE_Enabled :
                                       MPC_OVERRIDE_CONFIG_SECDOMENABLE_Disabled) <<
                                      MPC_OVERRIDE_CONFIG_SECDOMENABLE_Pos) |
#endif
                                     ((p_config->enable ? MPC_OVERRIDE_CONFIG_ENABLE_Enabled :
                                       MPC_OVERRIDE_CONFIG_ENABLE_Disabled) <<
                                      MPC_OVERRIDE_CONFIG_ENABLE_Pos));
}

NRF_STATIC_INLINE nrf_mpc_override_config_t nrf_mpc_override_config_get(NRF_MPC_Type const * p_reg,
                                                                        uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    nrf_mpc_override_config_t ret;

