pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_mpc.h
#if NRF_MPC_HAS_OVERRIDE_SLAVENUMBER
    ret.slave_number = (p_reg->OVERRIDE[index].CONFIG & MPC_OVERRIDE_CONFIG_SLAVENUMBER_Msk)
                        >> MPC_OVERRIDE_CONFIG_SLAVENUMBER_Pos;
#endif

    ret.lock = ((p_reg->OVERRIDE[index].CONFIG & MPC_OVERRIDE_CONFIG_LOCK_Msk)
                >> MPC_OVERRIDE_CONFIG_LOCK_Pos) == MPC_OVERRIDE_CONFIG_LOCK_Locked;

    ret.enable = ((p_reg->OVERRIDE[index].CONFIG & MPC_OVERRIDE_CONFIG_ENABLE_Msk)
                  >> MPC_OVERRIDE_CONFIG_ENABLE_Pos) == MPC_OVERRIDE_CONFIG_ENABLE_Enabled;
#if NRF_MPC_HAS_SECDOM
    ret.secdom_enable = ((p_reg->OVERRIDE[index].CONFIG & MPC_OVERRIDE_CONFIG_SECDOMENABLE_Msk)
                         >> MPC_OVERRIDE_CONFIG_SECDOMENABLE_Pos)
                        == MPC_OVERRIDE_CONFIG_SECDOMENABLE_Enabled;
#endif
#if NRF_MPC_HAS_OVERRIDE_SECUREMASK
    ret.secure_mask = ((p_reg->OVERRIDE[index].CONFIG & MPC_OVERRIDE_CONFIG_SECUREMASK_Msk)
                       >> MPC_OVERRIDE_CONFIG_SECUREMASK_Pos) ==
                      MPC_OVERRIDE_CONFIG_SECUREMASK_Enabled;
#endif

    return ret;
}

NRF_STATIC_INLINE void nrf_mpc_override_startaddr_set(NRF_MPC_Type * p_reg,
                                                      uint8_t        index,
                                                      uint32_t       address)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);
    NRFX_ASSERT((address & 0xFFFUL) == 0);

    p_reg->OVERRIDE[index].STARTADDR = address;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_override_startaddr_get(NRF_MPC_Type const * p_reg,
                                                          uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return p_reg->OVERRIDE[index].STARTADDR;
}

NRF_STATIC_INLINE void nrf_mpc_override_endaddr_set(NRF_MPC_Type * p_reg,
                                                    uint8_t        index,
                                                    uint32_t       address)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);
    NRFX_ASSERT((address & 0xFFFUL) == 0);

    p_reg->OVERRIDE[index].ENDADDR = address;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_override_endaddr_get(NRF_MPC_Type const * p_reg,
                                                        uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return p_reg->OVERRIDE[index].ENDADDR;
}

#if NRF_MPC_HAS_OVERRIDE_OFFSET
NRF_STATIC_INLINE void nrf_mpc_override_offset_set(NRF_MPC_Type * p_reg,
                                                   uint8_t        index,
                                                   uint32_t       offset)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);
    NRFX_ASSERT((offset & 0x3FFUL) == 0);

    p_reg->OVERRIDE[index].OFFSET = (int32_t)offset;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_override_offset_get(NRF_MPC_Type const * p_reg,
                                                       uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return (uint32_t)p_reg->OVERRIDE[index].OFFSET;
}
#endif

NRF_STATIC_INLINE void nrf_mpc_override_perm_set(NRF_MPC_Type * p_reg,
                                                 uint8_t        index,
                                                 uint32_t       permissions)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    p_reg->OVERRIDE[index].PERM = permissions;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_override_perm_get(NRF_MPC_Type const * p_reg,
                                                     uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return p_reg->OVERRIDE[index].PERM;
}

NRF_STATIC_INLINE void nrf_mpc_override_permmask_set(NRF_MPC_Type * p_reg,
                                                     uint8_t        index,
                                                     uint32_t       permissions)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    p_reg->OVERRIDE[index].PERMMASK = permissions;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_override_permmask_get(NRF_MPC_Type const * p_reg,
                                                         uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return p_reg->OVERRIDE[index].PERMMASK;
}

#if NRF_MPC_HAS_OVERRIDE_OWNERID
NRF_STATIC_INLINE void nrf_mpc_override_ownerid_set(NRF_MPC_Type * p_reg,
                                                    uint8_t        index,
                                                    nrf_owner_t    owner_id)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    p_reg->OVERRIDE[index].OWNER = (owner_id << MPC_OVERRIDE_OWNER_OWNERID_Pos) &
                                   MPC_OVERRIDE_OWNER_OWNERID_Msk;
}

NRF_STATIC_INLINE nrf_owner_t nrf_mpc_override_ownerid_get(NRF_MPC_Type const * p_reg,
                                                           uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return (nrf_owner_t)p_reg->OVERRIDE[index].OWNER;
}
#endif

#if NRF_MPC_HAS_OVERRIDE_MASTERPORT
NRF_STATIC_INLINE void nrf_mpc_override_masterport_set(NRF_MPC_Type * p_reg,
                                                       uint8_t        index,
                                                       uint32_t       mask)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    p_reg->OVERRIDE[index].MASTERPORT = mask;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_override_masterport_get(NRF_MPC_Type const * p_reg,
                                                           uint8_t              index)
{
    NRFX_ASSERT(index < NRF_MPC_OVERRIDE_COUNT);

    return p_reg->OVERRIDE[index].MASTERPORT;
}
#endif

NRF_STATIC_INLINE uint32_t nrf_mpc_memaccerr_address_get(NRF_MPC_Type const * p_reg)
{
    return p_reg->MEMACCERR.ADDRESS;
}

#if NRF_MPC_HAS_OVERRIDE_OWNERID
NRF_STATIC_INLINE nrf_owner_t nrf_mpc_memaccerr_info_ownerid_get(NRF_MPC_Type const * p_reg)
{
    return (nrf_owner_t)((p_reg->MEMACCERR.INFO & MPC_MEMACCERR_INFO_OWNERID_Msk)
                         >> MPC_MEMACCERR_INFO_OWNERID_Pos);
}
#endif

#if NRF_MPC_HAS_OVERRIDE_MASTERPORT
NRF_STATIC_INLINE uint8_t nrf_mpc_memaccerr_info_masterport_get(NRF_MPC_Type const * p_reg)
{
    return ((p_reg->MEMACCERR.INFO & MPC_MEMACCERR_INFO_MASTERPORT_Msk)
            >> MPC_MEMACCERR_INFO_MASTERPORT_Pos);
}
#endif

NRF_STATIC_INLINE uint32_t nrf_mpc_memaccerr_info_perm_get(NRF_MPC_Type const * p_reg)
{
    return ((p_reg->MEMACCERR.INFO &
             (MPC_MEMACCERR_INFO_READ_Msk | MPC_MEMACCERR_INFO_WRITE_Msk |
              MPC_MEMACCERR_INFO_EXECUTE_Msk | MPC_MEMACCERR_INFO_SECURE_Msk))
            >> MPC_MEMACCERR_INFO_READ_Pos);
}

NRF_STATIC_INLINE nrf_mpc_errorsource_t
nrf_mpc_memaccerr_info_errorsource_get(NRF_MPC_Type const * p_reg)
{
    return (nrf_mpc_errorsource_t)((p_reg->MEMACCERR.INFO & MPC_MEMACCERR_INFO_ERRORSOURCE_Msk)
                                   >> MPC_MEMACCERR_INFO_ERRORSOURCE_Pos);
}

#if NRF_MPC_HAS_GLOBALSLAVE
NRF_STATIC_INLINE void nrf_mpc_globalslave_masterport_set(NRF_MPC_Type * p_reg, uint32_t mask)
{
    p_reg->GLOBALSLAVE.MASTERPORT = mask;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_globalslave_masterport_get(NRF_MPC_Type const * p_reg)
{
    return p_reg->GLOBALSLAVE.MASTERPORT;
}

NRF_STATIC_INLINE void nrf_mpc_globalslave_lock_enable(NRF_MPC_Type * p_reg)
{
    p_reg->GLOBALSLAVE.LOCK = (MPC_GLOBALSLAVE_LOCK_LOCK_Enabled << MPC_GLOBALSLAVE_LOCK_LOCK_Pos);
}

NRF_STATIC_INLINE bool nrf_mpc_globalslave_lock_check(NRF_MPC_Type const * p_reg)
{
    return ((p_reg->GLOBALSLAVE.LOCK & MPC_GLOBALSLAVE_LOCK_LOCK_Msk)
            >> MPC_GLOBALSLAVE_LOCK_LOCK_Pos) == MPC_GLOBALSLAVE_LOCK_LOCK_Enabled;
}
#endif

#if NRF_MPC_HAS_RTCHOKE
NRF_STATIC_INLINE void nrf_mpc_rtchoke_writeaccess_set(NRF_MPC_Type * p_reg, uint32_t mask)
{
    p_reg->RTCHOKE.WRITEACCESS = mask;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_rtchoke_writeaccess_get(NRF_MPC_Type const * p_reg)
{
    return p_reg->RTCHOKE.WRITEACCESS;
}

NRF_STATIC_INLINE void nrf_mpc_rtchoke_readaccess_set(NRF_MPC_Type * p_reg, uint32_t mask)
{
    p_reg->RTCHOKE.READACCESS = mask;
}

NRF_STATIC_INLINE uint32_t nrf_mpc_rtchoke_readaccess_get(NRF_MPC_Type const * p_reg)
{
    return p_reg->RTCHOKE.READACCESS;
}

NRF_STATIC_INLINE void nrf_mpc_rtchoke_delay_set(NRF_MPC_Type * p_reg,
                                                 uint8_t        slave,
                                                 uint8_t        delay)
{
    NRFX_ASSERT(slave < NRF_MPC_RTCHOKE_COUNT);

    p_reg->RTCHOKE.DELAY[slave] = delay;
}

NRF_STATIC_INLINE uint8_t nrf_mpc_rtchoke_delay_get(NRF_MPC_Type const * p_reg, uint8_t slave)
{
    NRFX_ASSERT(slave < NRF_MPC_RTCHOKE_COUNT);

    return (uint8_t)p_reg->RTCHOKE.DELAY[slave];
}
#endif

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif /* NRF_MPC_H_ */
